temp/experimento2.org
* Resumo
Derivou-se as leis de Ohm, a qual originalmente veio de uma série de proposições de proporções entre grandezas físicas. Primeiro, considera-se a relação entre Voltagem e Corrente, apenas. Em sequência, as relações entre Corrente e Resistividade. Assim, deduz-se a forma da relação de $I(V,R)$.  Também, ascultamos a forma da Resistência, em função da da condutividade intrínseca do material e a sua forma geométrica - extrínseca - . i.e., $R(\pho, l, a)$. Assim, nossos experimentos demonstram como derivar as leis de Ohm, a partir de experimentos símiles ao feito pelo Georg Ohm.

* Introdução
** Bases teóricas e deduções
A lei de Ohm pode ser obtida a partir da variação parcial de parâmetros físicos. Se variarmos, para um dado material, e forma fixos, a Diferença de Potencial ($V$) entre duas pontas do material, então, necessariamente, há uma variação de Corrente ($I$).  De onde observa-se uma dependência diretamente proporcional entre $I$ e $V$.

\begin{equation}
\label{eq:IV}
I \propto V
\end{equation}

Ademais, ao variarmos o material, e fixarmos a geometria, temperatura e potencial, vemos uma mudança na Corrente $I$. Seja $\sigma$ a condutividade intrínseca do material,
\begin{equation}
\label{eq:IV}
I \propto \sigma
\end{equation}

Seja a resistividade intrínseca do material - $\rho$ - o inverso da condutividade,

\begin{equation}
\label{eq:IV}
I \propto \frac{1}{\rho}
\end{equation}

Por fim, variando-se a geometria, e fixando-se todos os outros parâmetros, encontramos que

\begin{equation}
\label{eq:IV}
(I \propto A) \land (I \propto \frac{1}{l})
\end{equation}

Em que $A$ é a área transversal à corrente $I$. E, $l$ a extensão do fio, paralelo a direção da corrente.

Dessa forma, deriva-se a lei de Ohm experimental,
\begin{equation}
  \begin{align}
  I &= \frac{\sigma A V}{l} \\
    \Leftrightarrow I &= \frac{V}{(\frac{\rho l}{A})}\\
    \Leftrightarrow I &= \frac{V}{R} \quad \land \quad R = \frac{\rho l}{A} 
  \end{align}
\end{equation}

** Implicações tecnológicas
A escolha de materiais é de extrema importância, na confecção de produtos eletrônicos, visto que pode-se aumentar a potência de processamento  - causado pela corrente de elétrons - sem, necessariamente, ter um aumento de voltagem e consequênte consumo de energia. Trabalhando na escolha dos materiais e sua geometria, pode-se controlar uma série de parâmetros de performace de equipamentos eletrônicos.

*** Lei de Moore 
De fato, essa lógica de aumento de potência, influênciando-se a forma e propriendades intrínsecas do material é tão forte que existe uma "Lei" empírica, a qual relaciona o aumento do número de resistores por unidade de área de um microchip. Consequentemente, essa também é uma "Lei" sobre a potência de processamento dos chips.

*** Barreiras e limites clássicos
Quando se diminui o tamanho dos resistores em microchips, para aumentar sua eficiência, existe um limite para o comportamento esperado, pela lei de Ohm. Pois, os materiais se portam de maneira não linear, e não clássica. Pois, em realidade, a aproximação \textit{Clássica} não é suficiente para prever o comportamento do material.

*** Região não-Ohmica
Ultrapassando-se o limite clássico, qualquer aumento de Corrente está ligada a um aumento exponencial da Voltagem. Assim, em limites não-Ohmicos, a lógica de aumentar eficiência, por meio da geometria do material, se torna insuficiente. E, este seria o limite da  "Lei" de Moore, prevista para ser atingida, comercialmente, em 2021-2022.
